tutorials/Poiseuille/Planar/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;

Hx  0.00045;
Hy  0.0009;
Hz  1e-05;

vertices
(

    name v0 (0 #calc "-1*$Hy" 0)
    name v1 ( $Hx #calc "-1*$Hy" 0)
    name v2 ( $Hx  $Hy 0)
    name v3 (0  $Hy 0)

    name v4 (0 #calc "-1*$Hy" $Hz)
    name v5 ( $Hx #calc "-1*$Hy" $Hz)
    name v6 ( $Hx  $Hy $Hz)
    name v7 (0  $Hy $Hz)

);

blocks
(
  hex (v0 v1 v2 v3 v4 v5 v6 v7) (1 40 1 )  simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (v0 v3 v7 v4)
        );
    }

    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        faces
        (
           (v1 v5 v6 v2)
        );
    }

    symmetry0
    {
        type empty;
        faces
        (
            (v0 v1 v2 v3)
        );
    }

    symmetry1
    {
        type empty;
        faces
        (
            (v4 v7 v6 v5)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (v0 v1 v5 v4)
            (v3 v2 v6 v7)
        );
    }
);

// ************************************************************************* //
