tutorials/Poiseuille/Planar/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.002 0 0);

boundaryField
{
    inlet
    {
        type            cyclic;
    }

    outlet
    {
        type               cyclic;
        value              $internalField;
        phi                phi;
        inletValue         $internalField;
    }

    "walls"
    {
        type            noSlip;
        value           uniform (0 0 0);
    }

    "symm.*"
    {
        type empty;
    }
}

// ************************************************************************* //
